dutylin/Hardware/lora node - 副本/Project/STM8L15x_StdPeriph_Template/main.c
/**
******************************************************************************
* @file    USART/USART_HyperTerminal_Interrupts/main.c
* @author  MCD Application Team
* @version V1.5.2
* @date    30-September-2014
* @brief   Main program body
******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
*
* Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
* You may not use this file except in compliance with the License.
* You may obtain a copy of the License at:
*
*        http://www.st.com/software_license_agreement_liberty_v2
*
* Unless required by applicable law or agreed to in writing, software 
* distributed under the License is distributed on an "AS IS" BASIS, 
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
******************************************************************************
*/ 

/* Includes ------------------------------------------------------------------*/
#include "stm8l15x.h"
#include "stm8_eval.h"
#include "B_SHT30A.h"
#include "RF_Process.h"
#include "rtc.h"
#include "PUMP_GPIO.h"
#include "adc.h"
/** @addtogroup STM8L15x_StdPeriph_Examples
* @{
*/

/**
* @addtogroup USART_HyperTerminal_Interrupts
* @{
*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void USART_Config(void);
void Delay (uint32_t nCount);
/* Private functions ---------------------------------------------------------*/

/**
* @brief  Main program.
* @param  None
* @retval None
*/
extern   u8 rtc_flag;
uint32_t systick_count;
void main(void)
{
  
  /*High speed internal clock prescaler: 1*/
  CLK_SYSCLKDivConfig(CLK_SYSCLKDiv_8);
  /* Enable ADC1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1, ENABLE);
  
  /* Enable DMA1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_DMA1, ENABLE);
  
  /* Enable TIM1 clock */
  CLK_PeripheralClockConfig(CLK_Peripheral_TIM1, ENABLE); 
  /* Initialize LEDs mounted on STM8L152X-EVAL board */
  //  STM_EVAL_LEDInit(LED1);
  //  STM_EVAL_LEDInit(LED2);
  //  STM_EVAL_LEDInit(LED3);
  //  STM_EVAL_LEDInit(LED4);
  adc_init();
  PUMP_GPIO_INIT();
  SHT30_Init();
  /* USART configuration -------------------------------------------*/
  USART_Config();
  systick_count=0;
  //RTC_init();
  while (1)
  {
    //ÎÂÊª¶È
   if(systick_count>=100000)
    {
      rtc_flag=0;
      systick_count=0;
      RF_Process() ;   
     GPIO_ToggleBits(GPIOD,GPIO_Pin_7);

    }
   systick_count++;
    server_command_process();
    //PUMP_test();
    // SHT30_Get_TH(&m_TemSymbol, &m_Tem, &m_Hum);
  }
}

/**
* @brief  Configure USART peripheral  
* @param  None
* @retval None
*/
static void USART_Config(void)
{
  /* USART configured as follow:
  - BaudRate = 115200 baud  
  - Word Length = 8 Bits
  - One Stop Bit
  - Odd parity
  - Receive and transmit enabled
  - USART Clock disabled
  */
  STM_EVAL_COMInit(COM1, (uint32_t)9600, USART_WordLength_8b, USART_StopBits_1,
                   USART_Parity_No, (USART_Mode_TypeDef)(USART_Mode_Tx | USART_Mode_Rx));
  /* Enable general interrupts */
  enableInterrupts();
  
  /* Enable the USART Receive interrupt: this interrupt is generated when the USART
  receive data register is not empty */
  USART_ITConfig(EVAL_COM1, USART_IT_RXNE, ENABLE);
  /* Enable the USART Transmit complete interrupt: this interrupt is generated when the USART
  transmit Shift Register is empty */
  USART_ITConfig(EVAL_COM1, USART_IT_TC, ENABLE);
  
  /* Enable USART */
  USART_Cmd(EVAL_COM1, ENABLE);
}

/**
* @brief  Delay.
* @param  nCount
* @retval None
*/
void Delay(uint32_t nCount)
{
  /* Decrement nCount value */
  while (nCount != 0)
  {
    nCount--;
  }
}

#ifdef  USE_FULL_ASSERT
/**
* @brief  Reports the name of the source file and the source line number
*   where the assert_param error has occurred.
* @param  file: pointer to the source file name
* @param  line: assert_param error line source number
* @retval None
*/
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
  ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  
  /* Infinite loop */
  while (1)
  {}
}
#endif
/**
* @}
*/

/**
* @}
*/
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
